// 系统版本更新记录
// 技术人员可以在此文件中添加或修改版本更新记录
export interface VersionInfo {
  version: string;
  date: string;
  changes: string[];
}

export const versionHistory: VersionInfo[] = [{
    version: '1.1.2',
    date: '2026-02-11',
    changes: [
      '取消业务数据备份和还原功能，改为自动更新'
    ]
  },
  {
    version: '1.1.1',
    date: '2026-02-09',
    changes: [
      '优化指令-excel数据提取：调整读取结构结构，包含data（二维列表，每个元素为 {"value":"xx","abs_pos":[],"style_id":0}）和 style_map（样式ID到样式字典的映射）',
      '优化指令-pv数据结构化指令：增加分区逻辑，以两个以上连续空行为分区标识'
    ]
  },
  {
    version: '1.1.0',
    date: '2026-02-05',
    changes: [
      '新增业务数据备份和还原功能',
      '优化数据流程节点执行状态和执行结果显示逻辑，可及时显示流程节点的执行情况',
      '优化指令-数据写入：提升写入效率，增加分块写入逻辑，每个分块区域调用一次com_api数据写入，批量写入后及时保存；增加分块样式单元格样式分组逻辑，每个单元格分组区域调用一次com_api样式设置'
    ]
  },
  {
    version: '1.0.1',
    date: '2026-01-23',
    changes: [
      '修复已知bug',
      '增加指令-"特征值分列"：对表格数据某列，按特征值进行表格区域分组，特征值作为新列的值'
    ]
  },
  {
    version: '1.0.0',
    date: '2026-01-16',
    changes: [
      '系统正式发布',
      '实现核心功能，包括数据源、模板管理、数据流程、指令配置',
      '数据源管理模块，仅支持excel类型',
      '模板配置模块，部分功能未实现'
    ]
  }
];
